Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 298, 298, 32)      320       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 149, 149, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 147, 147, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 73, 73, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 71, 71, 32)        18464     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 35, 35, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 33, 33, 16)        4624      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 16, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense (Dense)                (None, 300)               1229100   
_________________________________________________________________
dropout (Dropout)            (None, 300)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 240)               72240     
_________________________________________________________________
dropout_1 (Dropout)          (None, 240)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 192)               46272     
_________________________________________________________________
dropout_2 (Dropout)          (None, 192)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 154)               29722     
_________________________________________________________________
dropout_3 (Dropout)          (None, 154)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 123)               19065     
_________________________________________________________________
dropout_4 (Dropout)          (None, 123)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 98)                12152     
_________________________________________________________________
dropout_5 (Dropout)          (None, 98)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 79)                7821      
_________________________________________________________________
dropout_6 (Dropout)          (None, 79)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 63)                5040      
_________________________________________________________________
dropout_7 (Dropout)          (None, 63)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 50)                3200      
_________________________________________________________________
dropout_8 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 3)                 153       
=================================================================
Total params: 1,466,669
Trainable params: 1,466,669
Non-trainable params: 0
_________________________________________________________________
