backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 300
      - 300
      - 1
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id003 !!python/tuple
      - 3
      - 3
      name: conv2d
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d
      padding: valid
      pool_size: &id002 !!python/tuple
      - 2
      - 2
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: max_pooling2d
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_1
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_1
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_2
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_2
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_3
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_3
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: flatten
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 300
      use_bias: true
    inbound_nodes:
    - - - flatten
        - 0
        - 0
        - {}
    name: dense
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: dropout
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 123
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_2
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 79
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_3
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 50
      use_bias: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: dense_4
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_4
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
    inbound_nodes:
    - - - dense_4
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: depth
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: depth
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: sld
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: sld
  name: model
  output_layers:
  - - depth
    - 0
    - 0
  - - sld
    - 0
    - 0
keras_version: 2.2.4-tf
