Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 300, 300, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 298, 298, 32) 320         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 149, 149, 32) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 147, 147, 64) 18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 73, 73, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 71, 71, 32)   18464       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 35, 35, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 33, 33, 16)   4624        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 16)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
flatten (Flatten)               (None, 4096)         0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 300)          1229100     flatten[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 300)          0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 192)          57792       dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 192)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 123)          23739       dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 123)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 79)           9796        dropout_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 79)           0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           4000        dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 50)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
depth (Dense)                   (None, 2)            102         dropout_4[0][0]                  
__________________________________________________________________________________________________
sld (Dense)                     (None, 2)            102         dropout_4[0][0]                  
==================================================================================================
Total params: 1,366,535
Trainable params: 1,366,535
Non-trainable params: 0
__________________________________________________________________________________________________
